Tekla.Structures.Analysis.AnalysisModel.ConstructionMethodEnum
The construction methods.

Tekla.Structures.Analysis.AnalysisModel.ConstructionMethodEnum.FULL
The construction method is "full".

Tekla.Structures.Analysis.AnalysisModel.ConstructionMethodEnum.BOX
The construction method is "box".

Tekla.Structures.Analysis.AnalysisModel.ConstructionMethodEnum.SELECTED_PARTS
The construction method is "with selected parts".

Tekla.Structures.Analysis.AnalysisModel.ConstructionMethodEnum.SELECTED_PARTS_AND_LOADS
The construction method is "with selected parts and loads".

Tekla.Structures.Analysis.AnalysisModel.ConstructionMethodEnum.FLOOR_BY_SELECTED_PARTS_AND_LOADS
The construction method is "floor by selected parts and loads".